data/WS-Addressing/ws-addressing-20.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address></wsa:ReplyTo><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:7362a67c-3422-4b92-9820-4b9c8eae618e</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</Action></S:Header><S:Body><ns2:echoIn xmlns:ns2="http://example.org/echo">fault-test1141</ns2:echoIn></S:Body></S:Envelope>